<template>
	<section class="py-sm-7 py-5 position-relative">
		<div class="container">
			<div class="row">
				<div class="col-12 mx-auto">
					<div class="mt-n8 mt-md-n9 text-center">
						<div class="blur-shadow-avatar"></div>
					</div>

					<div class="row py-4 pt-8">
						<div class="col-6">
							<h3 class="mb-0">서비스이용약관동의</h3>
						</div>
						<div class="col-6 text-end">
							<div class="form-check">
								<input
									class="form-check-input"
									type="checkbox"
									value=""
									id="check1"
								/>
								<label class="form-check-label"> 동의 </label>
							</div>
						</div>
						<div class="scroll-container col-12">
							<p class="text-lg mb-0">"서비스 이용약관"</p>
							<p class="text-lg mb-0">
								제1장 총칙
제1조 (목적)
본 약관은 티머니(이하 ‘회사’라 합니다)가 제공하는 고속버스 티머니/시외버스 티머니 어플리케이션 서비스 및 고속버스통합예매 홈페이지의 이용과 관련하여 회사와 이용자 간의 권리, 의무 및 기타 제반 사항을 정함에 그 목적이 있습니다.
제2조 (약관의 적용)
① 서비스 이용자에게는 본 약관과 여객운송 사업자의 운송약관이 적용됩니다.
② 본 약관에서 규정되지 않은 사항에 대해서는 여객운송 사업자의 운송약관에 따릅니다.
제3조 (용어의 정의)
① 본 약관에서 사용하는 용어의 정의는 다음과 같습니다.
1. “서비스”란 이용자가 모바일 어플리케이션 상에서 고속ㆍ시외버스 승차권의 예매 및 예매 확인, 고속ㆍ시외버스 출발시간 확인과 기타 부가 기능을 이용 할 수 있도록 회사가 제공하는 서비스(고속버스 티머니 및 시외버스 티머니 어플리케이션, 고속버스통합예매 홈페이지)를 말합니다.
2. “모바일 기기”란 어플리케이션의 설치가 가능한 운영체재를 탑재하고 있는 스마트 폰, 태블릿 PC 등의 이동 통신 기기를 말합니다.
3. “이용자”란 본 약관에 따라 회사가 제공하는 서비스를 이용하는 회원과 비회원을 말합니다.
4. “회원”이란 회사가 정한 회원 가입 절차에 따라 계정 등록을 마친 이용자로서 결제 내역 조회, 1:1문의 등의 추가 기능을 사용할 수 있는 자를 말합니다.
5. “비회원”이란 회원 가입 절차에 따른 계정 등록을 하지 않고 서비스를 이용하는 자를 말합니다.
6. “모바일 승차권”이란 여객운송 사업자가 발행하는 고속ㆍ시외버스 승차권을 모바일 기기 어플리케이션으로 전송 받은 것을 말합니다.
7. “결제”란 이용자가 서비스 내에서 제공되는 결제수단으로 고속ㆍ시외버스 승차권의 예매 대금을 지불하는 행위를 말합니다.
8. “환불”이란 어플리케이션에서 예매한 승차권을 취소할 때 예매 대금을 이용자와 회사 간에 약정된 방법과 절차에 따라 이용자에게 돌려주는 것을 말합니다.
9. “모바일티머니”란 이동전화, 태블릿, 기타 모바일 기기 내에 장착되는 USIM chip 또는 SE(Secure Element, Embedded SE/Secure Memory card 등, 이하 USIM chip 등이라 함) 등에 회사가 발급하는 선불전자지급수단을 말합니다.
10. “신용카드”란 서비스 상에서 고속ㆍ시외버스 승차권의 예매 대금을 결제 할 수 있도록 회사와 계약이 체결 된 은행 또는 신용카드사가 발행한 신용카드 및 체크카드를 말합니다.
② 본 약관에서 사용하는 용어의 정의는 제1항에서 정하는 것을 제외하고는 여객운송 사업자의 운송약관, 관계 법령 및 서비스 별 안내에서 정하는 바에 의합니다.
제4조 (약관의 효력 및 변경)
① 본 약관은 회사가 본 약관의 내용을 서비스 화면에 게시하거나 기타의 방법으로 이용자에게 공지하고, 이용자가 이에 동의함으로써 적용됩니다.
② 회사는 필요하다고 인정되는 경우, 「약관의 규제에 관한 법률」, 「전자금융거래법」, 「정보통신망 이용촉진 및 정보보호 등에 관한 법률」 등 관련 법령을 위배하지 않는 범위에서 본 약관을 개정할 수 있습니다.
③ 회사가 약관을 변경할 경우에는 적용일자 및 변경사유를 명시하여 제1항과 같은 방법으로 그 시행일자로부터 14일 전에 공지합니다. 단, 이용자에게 불리한 약관 내용의 변경에 대해서는 30일 전에 공지합니다. 이용자의 연락처 변경 등으로 인하여 회사가 각 이용자에게 개별 통지 하기가 어려운 경우에는 본 항의 공지를 함으로써 개별 통지 한 것으로 간주합니다.
④ 이용자가 제3항에 따라 변경된 약관에 동의하지 않을 경우 서비스의 이용을 중단하고 이용 계약을 해지할 수 있습니다. 다만, 변경 약관 시행일의 전날까지 명시적으로 약관 변경 거부 의사를 표시하지 아니할 경우 변경 약관에 동의한 것으로 간주합니다.
제2장 서비스의 이용
제5조 (서비스 이용 계약의 체결)
① 이용자는 약관 동의 후 서비스의 이용이 가능합니다.
② 결제 내역 조회, 1:1문의 등 기타 추가 기능을 사용하기 위해서는 서비스 내 회원가입 절차를 통해 계정을 등록해야 합니다.
③ 회원가입 고객은 하나의 아이디와 비밀번호를 통해 본 약관 제3조 1항에 명시되어 있는 서비스를 이용할 수 있습니다.
④ 회사는 다음 각 호에 해당하는 회원가입 신청의 경우에는 이를 승낙하지 아니할 수 있습니다.
1. 기술상 서비스 제공이 불가능한 경우
2. 다른 사람의 정보를 사용하는 등 허위로 신청하는 경우
3. 이용자가 본 조 제2항에 따른 계정 등록 시 등록 사항을 누락하거나 잘못 입력 한 경우
4. 공공질서 또는 미풍양속을 저해하거나 저해할 목적으로 신청한 경우
5. 기타 회사가 정한 이용 신청 요건이 충족되지 않았을 경우
제6조(서비스의 제공 및 변경)
① 서비스의 제공은 연중무휴 1일 24시간을 원칙으로 하며, 구체적인 종류와 세부내용은 서비스 내 사용방법 FAQ 및 서비스 별 안내에 따릅니다.
② 회사는 기술적 사양의 변경 또는 기타 불가피한 여건이나 사정 등이 있는 경우에는 서비스의 내용을 변경 할 수 있습니다. 이 경우 변경된 서비스의 내용 및 제공 일자를 명시하여 이용자에게 공지 합니다.
제7조 (서비스의 중단)
① 회사는 다음 각 호에 해당하는 경우 이용자에 대한 서비스 제공을 중지 할 수 있습니다.
1. 컴퓨터, 서버 등 서비스 제공을 위한 설비의 보수, 점검, 교체, 고장 등으로 인하여 부득이 한 경우
2. 정전, 제반 설비의 장애 또는 이용량의 폭주 등으로 정상적인 서비스 제공에 지장이 있는 경우
3. 서비스 제휴 업체와의 계약 종료 등과 같은 회사의 제반 사정 또는 법률상의 장애 등으로 서비스를 유지할 수 없는 경우
4. 기타 천재지변, 국가비상사태 등 불가항력적 사유가 있는 경우
② 제1항에 의한 사유로 서비스가 일시 중지될 경우 회사는 인터넷 홈페이지 또는 어플리케이션을 통해 이를 사전에 공지합니다. 다만, 운영자의 고의 또는 과실이 없는 서버 장애, 시스템 다운 등 회사가 통제할 수 없는 사유로 인하여 이용자에게 사전 통지가 불가능한 경우에는 사후에 통지 할 수 있습니다.
제8조 (회원 탈퇴 및 자격 상실 등)
① 회원은 언제든지 어플리케이션 내 ‘설정’ 메뉴를 통해 회원 탈퇴를 신청 할 수 있습니다. 단, 승차권 예매 후 탑승이 이루어지지 않은 모바일 승차권을 보유하고 있을 경우에는 해당 승차권의 예매를 취소한 후 회원 탈퇴가 가능 하며, 본 약관 제3조 1항의 서비스에서 예매한 승차권 조회 및 이용이 불가 합니다.
② 다음 각 호의 사유에 해당하는 경우 회사는 회원의 자격을 정지 또는 상실 시킬 수 있습니다.
1. 가입 신청 시 허위의 내용을 등록 한 경우
2. 타인의 명예를 손상시키거나 불이익을 주는 행위
3. 서비스와 관련된 설비의 오 동작이나 정보 등의 파괴 및 혼란을 유발시키는 컴퓨터 바이러스 감염 자료를 등록 또는 유포하는 행위
4. 다른 사람의 개인정보를 도용하거나 서비스 이용을 방해하는 경우
5. 서비스를 이용하여 법령 또는 이 약관이 금지하는 행위를 하는 경우
6. 현금 융통, 시세 차익을 노린 승차권 선 예매 등 비정상적인 목적으로 서비스를 이용하는 경우
7. 서비스의 이용과 관련하여 취득한 타인의 개인정보를 무단으로 유용 또는 유출하는 행위
제9조 (승차권 예매)
① 서비스내에서 승차권 예매 시 이용자에게 부과되는 예매 수수료는 없으며, 이용자는 신용카드, 모바일티머니 또는 기타 회사가 추가로 정의하는 결제수단을 통해 결제 할 수 있습니다.
② 결제 수단 또는 예매 수수료와 관련하여 변경 사항이 발생하는 경우 회사는 그 내용을 서비스 내에 사전 고지 합니다.
제10조 (취소 및 환불)
① 서비스를 통한 예매 건의 취소 마감 시간은 서비스 내에 별도로 안내하며 취소 마감 시간은 여객운송 사업자, 터미널 등 관련 기관의 사정에 의해 변경 될 수 있습니다.
② 승차권 예매 취소에 따른 따른 환불 수수료는 여객운송 사업자의 운송약관이 정한 바에 따릅니다.
							</p>
						</div>
						<div class="col-6" style="padding-top: 30px">
							<h3 class="mb-0">운송약관 동의</h3>
						</div>
						<div class="col-6 text-end">
							<div class="form-check">
								<input
									class="form-check-input"
									type="checkbox"
									value=""
									id="check2"
								/>
								<label class="form-check-label"> 동의 </label>
							</div>
						</div>
						<div class="scroll-container col-12">
							<p class="text-lg mb-0">"고속버스 운송사업 운송약관"</p>
							<p class="text-lg mb-0">
								제1조 (목 적) 이 운송약관은(이하 약관이라 한다.) 여객자동차 운수사업법(이하 법이라 한다.) 제9조의 규정에 의하여 고속버스운송회사(이하 회사라 한다.)와 여객간의 운송에 관한 책임한계 및 경영에 필요한 사항을 규정함을 목적으로 한다.
제2조 (용어의 정의) 이 약관에 사용하는 용어의 정의는 다음과 같다.
1. 승차권이란 여객자동차운수사업법 시행규칙(이하 규칙이라 한다.) 제30조의 규정에 따라 운송을 위하여 회사가 발행하는 증표를 말한다.
2. 운임이란 회사에서 법 제8조의 규정에 의하여 관할관청에 신고 수리된 금액을 말한다.
3. 여객의 휴대품이란 여객이 소지하는 물품중 제23조의 규격기준에 부합하고 제26조의 소지제한 물품이 아닌 것으로 여객이 차내 반입하는 물품을 말한다.
4. 여객의 휴대화물이란 법 제18조의 규정에 의하여 운송되는 화물로 제23조의 규격 기준에 부합하고 제26조의 소지제한 물품이 아닌 것으로 물품적재 장치에 실은 물품을 말한다.
5. 인터넷승차권(홈티켓)이란 여객이 전국고속버스운송사업조합에서 운영하는 인터넷 홈페이지 내의 승차권 예약•예매서비스를 통해 지정된 양식으로 여객이 직접 발행한 승차권을 말한다.
6. 모바일승차권이란 여객이 전국고속버스운송사업조합에서 지정하는 고속버스 모바일앱내의 승차권 예매 서비스를 통해 휴대폰으로 전송받은 승차권을 말한다.
제3조 (약관의 적용)
① 이 약관은 회사에 의한 여객의 운송 또는 이에 부수되는 업무에 적용된다.
② 이 약관이 관계법규에 저촉된 때에는 적용하지 아니한다.
제4조 (여객의 동의) 여객이 회사가 제공하는 승차권 예약•예매서비스를 통해 승차권 예매, 인터넷 승차권(홈티켓), 모바일승차권 구입 발행받은 경우에는 이 약관 및 이에 의하여 정하여진 규정에 동의한 것으로 본다.
제5조 (약관의 변경) 이 약관 및 이에 의하여 정하여진 규정은 관할관청의 인가 또는 사업 개선명령에 의하여 변경될 수 있다.
제6조 (게시) 회사의 각 영업소에는 여객 운임표, 운송약관, 운행시간표 등을 여객이 보기 쉬운곳에 게시하여야 한다.
제7조 (종업원의 안내) 여객은 승, 하차 질서 확립과 안전운행을 위한 회사원의 안내에 따라야 한다.
제8조 (운행의 변경) 회사는 천재지변, 악천후, 도로의 정체 기타 불가항력적 사태 및 정부기관의 명령이 있을 때에는 운행의 일부 또는 전부를 취소하거나 운행시간의 변경할 수 있으며 여객 및 휴대화물 등의 운송을 제한할 수 있다.
제9조 (승차권의 발행 등)
① 회사는 터미널이나 인터넷승차권(홈티켓)을 발행할 때 발행자(터미널 또는 사업자) 회수용, 승객소지용으로 구분이 가능 하도록 발행하여야 하며 이 경우 승차권은 여객의 신청순서에 따라 발행하여야 한다. 단, 모바일승차권과 차량내 단말기에서 발행된 승차권은 승객용과 회수용으로 구분되지 않는다.
② 인터넷승차권(홈티켓)은 여객의 컴퓨터 및 출력장치(프린터기)를 통해 지정차량의 출발 1시간 전까지 발행할 수 있다. 단, 고객이 원하는 경우 인터넷을 통해 예약을 하고 터미널에서 지정차량의 출발 전까지 승차권을 발권 받을 수 있다.
③ 인터넷승차권(홈티켓)으로 여객이 발행받을 수 있는 승차권 매수는 1회에 6매까지 가능하며, 지정된 서식(A4규격)에 최대 4매까지 동시 발행이 가능하다.
④ 모바일승차권으로 여객이 휴대폰으로 전송받을 수 있는 승차권 매수는 1회에 6매까지 가능하다.
⑤ 발권방법에 따른 승차권의 취소, 변경은 다음 각 호에 가능하며, 발행된 승차권(터미널 창구발행 승차권, 인터넷승차권(홈티켓), 모바일승차권)의 지정차량, 등급 등의 변경은 기 발행된 승차권을 취소한 후 다시 승차권을 발급받은 것으로본다.
1. 터미널에서 발권한 승차권이나 인터넷승차권(홈티켓)의 취소는 지정된 차량의 도착전까지 출발지 터미널을 통해서만 가능하며, 변경은 출발지 터미널에서만 가능하다.
2. 모바일승차권의 취소는 지정된 차량의 도착 전까지 모바일 앱 또는 출발지 터미널을 통해 가능하며, 변경은 지정된 차량의 출발시각 전 모바일 앱 또는 출발지 터미널에 가능하다.
제10조 (승차권의 기재사항) 승객소지용 승차권에는 회사의 명칭, 사용구간, 사용시간, 운임액, 유효기간, 지정 좌석번호, 발행일, 발행자의 전화번호를 기재하고 뒷면 또는 앞면에 주요 운송약관을 기재하여 발행하여야 한다.

							</p>
						</div>
						<div class="col-6" style="padding-top: 30px">
							<h3 class="mb-0">개인정보 수집 및 이용 동의</h3>
						</div>
						<div class="col-6 text-end">
							<div class="form-check">
								<input
									class="form-check-input"
									type="checkbox"
									value=""
									id="check3"
								/>
								<label class="form-check-label"> 동의 </label>
							</div>
						</div>
						<div class="scroll-container col-12">
							<p class="text-lg mb-0">"개인정보 수집 및 이용 동의"</p>
							<p class="text-lg mb-0">
								1. 개인정보를 제공받는 자
고속버스 승차권 온라인 예매 서비스의 제공

2. 수집하는 항목
신용카드 번호ㆍ유효기간ㆍ신용카드 비밀번호 앞 2자리, 생년월일, 휴대전화번호

3. 보유 및 이용 기간
5년 (근거: 전자상거래 등에서의 소비자 보호에 관한 법률)

4. 개인정보 수집 및 이용 동의 거부 시 승차권 예매 하실 수 없습니다.
시행일자 : 2017년 5월 18일
							</p>
						</div>
						<MaterialButton
							class="my-4 mb-2 col-12"
							variant="contained"
							color="dark"
							fullWidth
							@click="AllAgree"
						>
							전체 동의
						</MaterialButton>
					</div>
				</div>
			</div>
		</div>
	</section>
</template>
<script setup>
import MaterialButton from '@/components/MaterialButton.vue';
const AllAgree = () => {
	let check1 = document.getElementById("check1");
	let check2 = document.getElementById("check2");
 let check3 = document.getElementById("check3");
	if (check1.checked && check2.checked&& check3.checked) {
		check1.checked = false;
		check2.checked = false;
check3.checked = false;
	} else {
		check1.checked = true;
		check2.checked = true;
		check3.checked = true;
	}
};

</script>
<style scoped>
.scroll-container {
	height: 160px; /* 스크롤 가능한 영역의 높이 지정 */
	overflow-y: scroll; /* y축 스크롤만 허용 */
	border: 1px solid #ccc; /* 컨테이너 테두리 스타일 지정 */
}

.scroll-container p {
	font-size: 16px; /* 글자 크기 지정 */
	line-height: 1.5; /* 줄간격 조정 */
	padding: 10px; /* 내부 여백 조정 */
}

.scroll-container::-webkit-scrollbar {
	width: 6px; /* 스크롤바 가로길이 지정 */
}

.scroll-container::-webkit-scrollbar-thumb {
	background-color: #ccc; /* 스크롤바 썸네일 색상 지정 */
	border-radius: 3px; /* 스크롤바 썸네일 모서리 둥글게 처리 */
}
.form-check-label {
	color: #59b55c;
	accent-color: #59b55c;
}
.form-check-input:checked {
  background-color: #59b55c !important;
  border-color: #59b55c !important;
}
</style>
